#
# 4. Анализ файлов
#

cd lab0
mkdir tmp
touch tmp/errors

# 4.1
# Подсчитать количество символов содержимого файлов: 
# musharna, treecko, prinplup, nidorina, burmy, simisear, 
# отсортировать вывод по уменьшению количества, ошибки доступа 
# перенаправить в файл в директории /tmp

echo "\n-> 4.1"

wc -c musharna hippowdon2/treecko hippowdon2/prinplup rapidash7/nidorina rapidash7/burmy rapidash7/simisear 2>> tmp/errors | sort -nk1 -r

# 4.2
# Вывести два первых элемента рекурсивного списка имен и атрибутов файлов 
# в директории lab0, содержащих строку "se", список отсортировать по убыванию 
# размера, ошибки доступа перенаправить в файл в директории /tmp

echo "\n-> 4.2"

ls -R -S 2>> tmp/errors | grep "se" | head -2

# 4.3
# Рекурсивно вывести содержимое файлов с номерами строк из директории lab0, 
# имя которых начинается на 'f', строки отсортировать по имени a->z, 
# ошибки доступа перенаправить в файл в директории /tmp

echo "\n-> 4.3"

cat -n f* */f* */*/f* 2>> tmp/errors | sort -d

# 4.4
# Вывести содержимое файлов с номерами строк в директории rapidash7, оставить 
# только строки, содержащие "Sla", ошибки доступа не подавлять и не перенаправлять

echo "\n-> 4.4"

cat -n rapidash7/* | grep "Sla"

# 4.5
# Вывести рекурсивно список имен и атрибутов файлов в директории lab0, 
# начинающихся на символ 'm', список отсортировать по возрастанию размера, 
# ошибки доступа перенаправить в файл в директории /tmpЫ

echo "\n-> 4.5"

ls -R -Sr 2>> tmp/errors | grep "^m"

# 4.6
# Рекурсивно подсчитать количество строк содержимого файлов из директории lab0,
# имя которых заканчивается на 'l', отсортировать вывод по уменьшению количества, 
# ошибки доступа перенаправить в файл в директории /tmp

echo "\n-> 4.6"

wc -l *l */*l 2>> tmp/errors | sort -nk1

